src/Catalogs/СправочникУкравто/СправочникУкравто.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СправочникУкравто</name>
  <attributes>
    <name>Должность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Почта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Телефон1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Телефон2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Телефон3</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Категория</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Департамент</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/СправочникУкравто/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура НабратьТелефон(Команда)
	ПозвонитьПоНомеру(Объект.Телефон);
КонецПроцедуры

&НаКлиенте
Процедура ПозвонитьПоНомеру(НомерТелефона)
	
	Если ПустаяСтрока(СокрЛП(НомерТелефона)) Тогда
		Возврат;
	КонецЕсли;
			
	#Если МобильноеПриложениеКлиент Тогда
	Если СредстваТелефонии.ПоддерживаетсяНаборНомера() Тогда
	    СредстваТелефонии.НабратьНомер(НомерТелефона, Истина);
	КонецЕсли;
	#КонецЕсли
КонецПроцедуры

&НаКлиенте
Функция ОбработатьТелефон(Телефон)
	Телефон = СтрЗаменить(Телефон,"-","");
	Телефон = СтрЗаменить(Телефон," ","");
	Телефон = СокрЛП(Телефон);
	
	Возврат Телефон;
КонецФункции

&НаКлиенте
Процедура НабратьТелефон1(Команда)
	ПозвонитьПоНомеру(Объект.Телефон1);
КонецПроцедуры

&НаКлиенте
Процедура НабратьТелефон2(Команда)
	ПозвонитьПоНомеру(Объект.Телефон2);
КонецПроцедуры

&НаКлиенте
Процедура НабратьТелефон3(Команда)
	ПозвонитьПоНомеру(Объект.Телефон3);
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьСообщениеНаПочту()
	Если ЗначениеЗаполнено(Объект.Почта) Тогда
		ТемаСообщения = "Введите тему сообщения!";
		ТекстСообщения = "Введите текст сообщения!";
		ЗапуститьПриложение("mailto:" + СокрЛП(Объект.Почта) + "?subject=" + ТемаСообщения + "&body=" + ТекстСообщения);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НаписатьНаПочту(Команда)
	ОтправитьСообщениеНаПочту();
КонецПроцедуры
